RIET/src/DataProcessors/rgsМониторСопровождения/rgsМониторСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>rgsМониторСопровождения</name>
  <comment>Обработка подключения к Монитору сопровождения, версия 2.0.5.7</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗакрытыеОтмененныеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИДТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТекстВопросаСЗадержкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновленияТекстаВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоМои</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПомощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПроектовИПользователей</name>
    <attributes>
      <name>НаименованиеПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СторонаПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСотрудникомПоддержки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаЗадач</name>
    <attributes>
      <name>ГУИДЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДВидаЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокСуществующихНастроек</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Настройки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/DataProcessors/rgsМониторСопровождения/Forms/ФормаНастроекФормы/Module.bsl
&НаКлиенте
Перем ИндексСтроки Экспорт;
&НаКлиенте
Перем ИндексСтрокиОбщ Экспорт;

&НаКлиенте
Процедура СписокНастроекПриАктивизацииСтроки(Элемент)
	ИндексСтроки = ?(Элемент.ТекущиеДанные = Неопределено ,Неопределено,Элемент.ТекущиеДанные.НомерСтроки - 1); 
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Отбор = Новый Структура;
	
	Отбор.Вставить("КлючОбъекта",ПолучитьНаименованиеОсновнойФормы() + "/НастройкиФормы");
	// { RGS Козлов К.С. 02.02.2016 16:57:58
	Отбор.Вставить("Пользователь","");
	// } RGS Козлов К.С. 02.02.2016 16:57:58
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(ФормированиеТаблицыНастроек(Отбор,Истина)); 
КонецПроцедуры

&НаСервере
Функция ФормированиеТаблицыНастроек(Отбор,Список)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыборкаПоОтбору = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	
	Если Список Тогда
		СписокНастроек = Новый Массив;
		ТаблицаНастроек = Новый ТаблицаЗначений;
		ТаблицаНастроек.Колонки.Добавить("НаименованиеНастройки",Новый ОписаниеТипов("Строка"));
	
		Пока ВыборкаПоОтбору.Следующий() Цикл
			// { RGS Козлов К.С. 02.02.2016 13:45:24
			//НоваяСтрока = ТаблицаНастроек.Добавить();
			//НоваяСтрока.НаименованиеНастройки = ВыборкаПоОтбору.КлючНастроек;
			Если ЗначениеЗаполнено(ВыборкаПоОтбору.КлючНастроек) Тогда
				НоваяСтрока = ТаблицаНастроек.Добавить();
				НоваяСтрока.НаименованиеНастройки = ВыборкаПоОтбору.КлючНастроек;
			КонецЕсли;
			// } RGS Козлов К.С. 02.02.2016 13:45:24
		КонецЦикла;
	
		ТаблицаНастроек.Свернуть("НаименованиеНастройки");
		Для Каждого Строка Из ТаблицаНастроек Цикл
			СписокНастроек.Добавить(Строка.НаименованиеНастройки);
		КонецЦикла;
		
		Возврат СписокНастроек;
	Иначе
		НастройкиБазы.Очистить();
	
		ТаблицаНастроек = Новый ТаблицаЗначений;
		ТаблицаНастроек.Колонки.Добавить("НаименованиеНастройки",Новый ОписаниеТипов("Строка"));
	
		Пока ВыборкаПоОтбору.Следующий() Цикл
			// { RGS Козлов К.С. 02.02.2016 13:45:24
			//НоваяСтрока = ТаблицаНастроек.Добавить();
			//НоваяСтрока.НаименованиеНастройки = ВыборкаПоОтбору.КлючНастроек;
			Если ЗначениеЗаполнено(ВыборкаПоОтбору.КлючНастроек) Тогда
				НоваяСтрока = ТаблицаНастроек.Добавить();
				НоваяСтрока.НаименованиеНастройки = ВыборкаПоОтбору.КлючНастроек;
			КонецЕсли;
			// } RGS Козлов К.С. 02.02.2016 13:45:24
		КонецЦикла;
	
		ТаблицаНастроек.Свернуть("НаименованиеНастройки");
	
		Возврат ТаблицаНастроек;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&НаКлиенте
Процедура НастройкиБазыПриАктивизацииСтроки(Элемент)
	ИндексСтрокиОбщ = ?(Элемент.ТекущиеДанные = Неопределено ,Неопределено,Элемент.ТекущиеДанные.НаименованиеНастройки); 
КонецПроцедуры

&НаКлиенте
Процедура НастройкиБазыНаименованиеНастройкиПриИзменении(Элемент)
	 ИндексСтрокиОбщ = ?(Элемент.ТекстРедактирования = Неопределено ,Неопределено,Элемент.ТекстРедактирования);
 КонецПроцедуры
 
 &НаКлиенте
Процедура ЗагрузитьНастройкиОбщ(Команда)
	ПараметрыФормы = Новый Структура;
	// { RGS Козлов К.С. 02.02.2016 15:12:08
	//ПараметрыФормы.Вставить("НастройкиФормы",ЗагрузитьНастройкиНаСервере(ИндексСтрокиОбщ ,Истина));
	ПараметрыФормы.Вставить("КлючНастройки",ИндексСтрокиОбщ);
	// } RGS Козлов К.С. 02.02.2016 15:12:08
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.Форма", ПараметрыФормы,,Новый УникальныйИдентификатор);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.Форма", ПараметрыФормы,,Новый УникальныйИдентификатор);
	КонецПопытки;
	ЭтаФорма.ВладелецФормы.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбщНастройку(Команда)
	 УдалитьНастройкуНаСервере(ИндексСтрокиОбщ,Истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьОбщНастройкуНаСервере(НомерСтроки)
	АдресФормы = ПолучитьНаименованиеОсновнойФормы();
	МассивНастроекДляКопирования = ПолучитьМассивНастроек();
	
	ПользователиПриемник = Новый Массив;
	ПользователиПриемник.Добавить("");
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СкопироватьНастройкиФорм(ПользователиПриемник, МассивНастроекДляКопирования, "", ПолучитьМассивСтруктурИзТЗ(),ПолучитьМассивСтруктурИзТЗОбъекта(),НомерСтроки)
	

	//ХранилищеСистемныхНастроек.Сохранить(АдресФормы,ТекСтрока.НаименованиеНастройки);
	//ХранилищеНастроекДанныхФорм.Сохранить(АдресФормы,ТекСтрока.НаименованиеНастройки);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбщНастройку(Команда)
	СохранитьОбщНастройкуНаСервере(ИндексСтрокиОбщ);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователей(Команда)
	
	СписокПользователей = ПолучитьСиписокПользователей();
	
	Если СписокПользователей.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Невозможно скопировать настройки, так как в системе не заведен ни один пользователь.'; en = 'You can not copy the settings , since the system is not on any user.'"));
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = СписокПользователей.НайтиПоЗначению(Объект.Пользователь);
	Если ЭлементСписка <> Неопределено Тогда
		СписокПользователей.Удалить(ЭлементСписка);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Администратор", Администратор);
	СтруктураПараметров.Вставить("СписокПользователей", СписокПользователей);
	СтруктураПараметров.Вставить("РежимОткрытия", "Добавление");
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаВыбораПользователей", СтруктураПараметров, ЭтаФорма, ,ВариантОткрытияОкна.ОтдельноеОкно);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаВыбораПользователей", СтруктураПараметров, ЭтаФорма, ,ВариантОткрытияОкна.ОтдельноеОкно);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройку(Команда)
	
	НоваяСтрока = НастройкиБазы.Добавить();
	НоваяСтрока.НаименованиеНастройки = "Настройки по умолчанию";
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуНаСервере(НомерСтроки,ОбщНастройка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ОбщНастройка Тогда
		Представление	= НомерСтроки;
		Пользователь 	= "";
	Иначе             	
		ТекущаяСтрока 	= ОбработкаОбъект.СписокСуществующихНастроек.Получить(НомерСтроки);
		Пользователь 	= ТекущаяСтрока.Пользователь;
		Представление 	= ТекущаяСтрока.Представление;
	КонецЕсли;
	
	Отбор = Новый Структура;
	АдресФормы = ПолучитьНаименованиеОсновнойФормы(); 
	Отбор.Вставить("КлючОбъекта",АдресФормы + "/НастройкиФормы");
	Отбор.Вставить("КлючНастроек",Представление);
	// { RGS Козлов К.С. 02.02.2016 16:59:17
	//Отбор.Вставить("Пользователь",Пользователь);
	Если Не ОбщНастройка Тогда
		Отбор.Вставить("Пользователь",Пользователь);
	КонецЕсли;
	// } RGS Козлов К.С. 02.02.2016 16:59:17
	
	Выборка = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		НастройкиФормы = ХранилищеСистемныхНастроек.Загрузить(Выборка.КлючОбъекта,Выборка.КлючНастроек,,Выборка.Пользователь);
		ХранилищеСистемныхНастроек.Удалить(Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Пользователь);
		ХранилищеНастроекДанныхФорм.Удалить(Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Пользователь);
	КонецЦикла;
	
		
	Если ОбщНастройка Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("НаименованиеНастройки",НомерСтроки);
		МассивУдаления = НастройкиБазы.НайтиСтроки(Отбор);
		Для Каждого СтрокаУдаления Из МассивУдаления Цикл
			НастройкиБазы.Удалить(СтрокаУдаления);
		КонецЦикла;
		Отбор = Новый Структура;
		Отбор.Вставить("Представление",НомерСтроки);
		МассивУдаления = ОбработкаОбъект.СписокСуществующихНастроек.НайтиСтроки(Отбор);
		Для Каждого СтрокаУдаления Из МассивУдаления Цикл
			ИндексУдаления = ОбработкаОбъект.СписокСуществующихНастроек.Индекс(СтрокаУдаления);
			ОбработкаОбъект.СписокСуществующихНастроек.Удалить(ИндексУдаления);
		КонецЦикла;
		
		ЗначениеВДанныеФормы(ОбработкаОбъект.СписокСуществующихНастроек,Объект.СписокСуществующихНастроек);
	Иначе
		ОбработкаОбъект.СписокСуществующихНастроек.Удалить(НомерСтроки);
		ЗначениеВДанныеФормы(ОбработкаОбъект.СписокСуществующихНастроек,Объект.СписокСуществующихНастроек);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройку(Команда)
	УдалитьНастройкуНаСервере(ИндексСтроки,Ложь);
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеОсновнойФормы()

	НаименованиеФормыНастроек = ЭтаФорма.ИмяФормы;
	Наименованиеобработки = ЛЕВ(НаименованиеФормыНастроек, СтрДлина(НаименованиеФормыНастроек) - 24);
	
	Возврат Наименованиеобработки + "Форма.Форма";
	
КонецФункции // ()

&НаСервере
Функция ПолучитьМассивНастроек()

	Массив = Новый Массив;
	НаименованиеФормыНастроек = ЭтаФорма.ИмяФормы;
	Наименованиеобработки = ЛЕВ(НаименованиеФормыНастроек, СтрДлина(НаименованиеФормыНастроек) - 24);
	Массив.Добавить(Наименованиеобработки + "Форма.Форма");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаВопроса");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаВыбораТемыНовогоВопроса");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаДобавленияСообщения");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаКИ");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаКонтроляВерсий");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаНастройки");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаНастроекФормы");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаНовогоВопроса");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаОбсуждающие");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаОбсуждающиеИзменение");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаПомощникаВводаВопроса");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаПредупреждения");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаПрикрепленныхФайлов");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаПроверкиОрфографии");
	Массив.Добавить(Наименованиеобработки + "Форма.ФормаВводаПланФактЧасов");
	
	Возврат Массив;
	
КонецФункции // ()

&НаСервере
Функция ПолучитьМассивСтруктурИзТЗ()
	ТЗ = ТаблицаОтбора.Выгрузить();
	МассивВозврата = Новый Массив;
	Для каждого СтрокаТЗ Из ТЗ Цикл
		СтруктураСтроки = Новый Структура; 
		Для каждого Колонка Из ТЗ.Колонки Цикл
			СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
		КонецЦикла;
	    МассивВозврата.Добавить(СтруктураСтроки);
	КонецЦикла; 
	
	Возврат МассивВозврата;
КонецФункции

&НаСервере
Функция ПолучитьМассивСтруктурИзТЗОбъекта()
	ТЗ = Объект.СохраненныеНастройки.Выгрузить();
	МассивВозврата = Новый Массив;
	Если ТЗ.Количество() <> 0 Тогда
		Для каждого СтрокаТЗ Из ТЗ Цикл
			СтруктураСтроки = Новый Структура; 
			Для каждого Колонка Из ТЗ.Колонки Цикл
				СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
			КонецЦикла;
			МассивВозврата.Добавить(СтруктураСтроки);
		КонецЦикла;
	Иначе
		ТЗ = Объект.СписокСуществующихНастроек.Выгрузить();
		Для каждого СтрокаТЗ Из ТЗ Цикл
			СтруктураСтроки = Новый Структура; 
			Для каждого Колонка Из ТЗ.Колонки Цикл
				СтруктураСтроки.Вставить(?(Колонка.Имя = "Представление","КлючНастроек",Колонка.Имя), СтрокаТЗ[Колонка.Имя]);
			КонецЦикла;
			МассивВозврата.Добавить(СтруктураСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

&НаСервере
Функция ПолучитьСиписокПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	СписокПользователейИБ = Новый СписокЗначений;
	
	Для каждого ПользовательИБ Из МассивПользователейИБ Цикл
	    //Фёдорова
		СписокПользователейИБ.Добавить(ПользовательИБ.Имя);	
	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокПользователейИБ;
	
КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = Параметры.Пользователь;
	Администратор 		= Параметры.Администратор;
	// { RGS Глебов Дмитрий 01.07.2016 
	Объект.АдресБазы = Параметры.АдресБазы;
	Объект.ЗагружатьЗакрытыеОтмененныеВопросы = Параметры.ЗагружатьЗакрытыеОтмененныеВопросы;
	Объект.ОбновлятьАвтоматически = Параметры.ОбновлятьАвтоматически;
	Объект.ВремяОбновления = Параметры.ВремяОбновления;
	Объект.ОтображатьТекстВопросаСЗадержкой = Параметры.ОтображатьТекстВопросаСЗадержкой;
	Объект.ВремяОбновленияТекстаВопроса = Параметры.ВремяОбновленияТекстаВопроса;
	Объект.ТолькоМои = Параметры.ТолькоМои;
	Объект.ПоказатьПолностью = Параметры.ПоказатьПолностью;
	Объект.ОтображатьКонтакты = Параметры.ОтображатьКонтакты;
	Объект.ИспользоватьПомощник = Параметры.ИспользоватьПомощник;
	// } RGS Глебов Дмитрий 01.07.2016
	
	ЗаполнитьТаблицуОтбора(Параметры.ТаблицаОтбора); 
	ОбновлениеСпискаНастроек();
	
	ПолучитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтбора(Массив)
	ТЗ = ТаблицаОтбора.Выгрузить(); 
	Для каждого ЭлементМассива Из Массив Цикл
		СтрокаТЗ = Тз.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, ЭлементМассива);
	КонецЦикла; 
	ТаблицаОтбора.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиФормы()

   ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
   Если Параметры.Свойство("КлючНастройки") Тогда
		КлючНастройки = Параметры.КлючНастройки;
		Пользователь = "";
	Иначе
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		КлючНастройки = "";
	КонецЕсли;
	ОбработкаОбъект.ПолучитьНастройкиФормы(ЭтаФорма, КлючНастройки);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗакрыватьПриЗакрытииВладельца = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//РГС Фёдорова 27.01.16  Изменена настройка возврата формы с контрагентами
	Если ИмяСобытия = "ПользователиВыбраны" Тогда
		СкопироватьНаСервере(Параметр.ПользователиПриемник);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки скопированы'; en = 'Settings copied'"));
		СкопироватьНастройкуНаСервере(ИндексСтроки,Параметр.ПользователиПриемник);	
	ИначеЕсли ИмяСобытия = "ПользователиДобавлены" Тогда
		ДобавитьНастройкуНаСервере(Параметр.ПользователиПриемник);
	КонецЕсли;
	//РГС Фёдорова 27.01.16 Конец изменений
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере(ПользователиПриемник)
	
	МассивНастроекДляКопирования = ПолучитьМассивНастроек();
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СкопироватьНастройкиФорм(ПользователиПриемник, МассивНастроекДляКопирования,  "", ПолучитьМассивСтруктурИзТЗ(),ПолучитьМассивСтруктурИзТЗОбъекта(),"Настройки по умолчанию");
	 	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкуНаСервере(ИндексСтроки, ПользователиПриемник)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	УстановитьПривилегированныйРежим(Истина);
	МассивНастроекДляКопирования = ПолучитьМассивНастроек();
	Если ИндексСтроки = Неопределено Тогда
		Для Каждого ПользовательПриемник Из ПользователиПриемник Цикл
			НастройкиФормы = ХранилищеСистемныхНастроек.Загрузить(ПолучитьНаименованиеОсновнойФормы() + "/НастройкиФормы",,,ПользователиИнформационнойБазы.ТекущийПользователь());
			ХранилищеСистемныхНастроек.Сохранить(ПолучитьНаименованиеОсновнойФормы()+"/НастройкиФормы","Настройка по умолчанию",НастройкиФормы,, ?(ЗначениеЗаполнено(ПользовательПриемник),ПользовательПриемник,""));
			ХранилищеНастроекДанныхФорм.Сохранить(ПолучитьНаименованиеОсновнойФормы(),"Настройка по умолчанию",НастройкиФормы,,?(ЗначениеЗаполнено(ПользовательПриемник),ПользовательПриемник,""));
		КонецЦикла;
		ОбработкаОбъект.СкопироватьНастройкиФорм(ПользователиПриемник, МассивНастроекДляКопирования,  "", ПолучитьМассивСтруктурИзТЗ(),ПолучитьМассивСтруктурИзТЗОбъекта());
		ОбновлениеСпискаНастроек();
	Иначе
		ТекущаяСтрока = ОбработкаОбъект.СписокСуществующихНастроек.Получить(ИндексСтроки);
		Для Каждого ПользовательПриемник Из ПользователиПриемник Цикл
			НоваяСтрока = ОбработкаОбъект.СписокСуществующихНастроек.Добавить();
			НоваяСтрока.КлючОбъекта 	= ТекущаяСтрока.КлючОбъекта;
			НоваяСтрока.Пользователь	= ПользовательПриемник;
			НоваяСтрока.Настройки 		= ТекущаяСтрока.Настройки;
			НоваяСтрока.Представление 	= ТекущаяСтрока.Представление;
		КонецЦикла;
	КонецЕсли;
	ЗначениеВДанныеФормы(ОбработкаОбъект.СписокСуществующихНастроек,Объект.СписокСуществующихНастроек);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуНаСервере(СписокПользователей)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого Строка Из СписокПользователей Цикл
		НоваяСтрока = ОбработкаОбъект.СписокСуществующихНастроек.Добавить();
		НоваяСтрока.Пользователь = Строка;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ОбработкаОбъект.СписокСуществующихНастроек,Объект.СписокСуществующихНастроек);
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСпискаНастроек()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Отбор = Новый Структура;
	Отбор.Вставить("КлючОбъекта",ПолучитьНаименованиеОсновнойФормы() + "/НастройкиФормы");
	ОбработкаОбъект.СписокСуществующихНастроек.Очистить();
	ВыборкаПоОтбору = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	
	Пока ВыборкаПоОтбору.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОтбору.КлючНастроек) Тогда
			// { RGS Козлов К.С. 02.02.2016 13:20:05
			//ХранилищеСистемныхНастроек.Удалить(ВыборкаПоОтбору.КлючОбъекта,ВыборкаПоОтбору.КлючНастроек,ВыборкаПоОтбору.Пользователь);
			// } RGS Козлов К.С. 02.02.2016 13:20:05
		Иначе
			Если ЗначениеЗаполнено(ВыборкаПоОтбору.Пользователь) Тогда
				НоваяСтрока = ОбработкаОбъект.СписокСуществующихНастроек.Добавить();
				НоваяСтрока.КлючОбъекта 	= ВыборкаПоОтбору.КлючОбъекта;
				НоваяСтрока.Пользователь 	= ВыборкаПоОтбору.Пользователь;
				НоваяСтрока.Настройки	 	= ЗначениеВСтрокуВнутр(ВыборкаПоОтбору.Настройки);
				НоваяСтрока.Представление	= ВыборкаПоОтбору.КлючНастроек;
			Иначе
				НоваяСтрока = НастройкиБазы.Добавить();
				НоваяСтрока.НаименованиеНастройки 	= ВыборкаПоОтбору.КлючНастроек;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НастройкиБазы.Загрузить(ФормированиеТаблицыНастроек(Отбор,Ложь));
	
	ЗначениеВДанныеФормы(ОбработкаОбъект.СписокСуществующихНастроек,Объект.СписокСуществующихНастроек);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура формирует структуру настроек
//
Процедура ОК(Команда)
	
	//Структура = Новый Структура;
	//Структура.Вставить("Пользователь", Объект.Пользователь);	
	////РГС Фёдорова 27.01.16 Добавлено сохранение настроек
	//Структура.Вставить("СохраненныеНастройки", ПолучитьМассивСтруктурИзТЗОбъекта());
	////РГС Фёдорова 27.01.16 Конец добавлений
	
	СохранитьНастройкиНаСервере();	
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	// { RGS Козлов К.С. 02.02.2016 13:56:30
	УстановитьПривилегированныйРежим(Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("КлючОбъекта",ПолучитьНаименованиеОсновнойФормы()+ "/НастройкиФормы");
	ВыборкаПоОтбору = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	Пока ВыборкаПоОтбору.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаПоОтбору.Пользователь) ИЛИ Не ЗначениеЗаполнено(ВыборкаПоОтбору.КлючНастроек) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОтбора = Новый Структура("Пользователь,Представление",ВыборкаПоОтбору.Пользователь,ВыборкаПоОтбору.КлючНастроек);
		Если НЕ Объект.СписокСуществующихНастроек.НайтиСтроки(СтруктураОтбора).Количество() Тогда 
			ХранилищеСистемныхНастроек.Удалить(ВыборкаПоОтбору.КлючОбъекта,ВыборкаПоОтбору.КлючНастроек,ВыборкаПоОтбору.Пользователь);
			ХранилищеНастроекДанныхФорм.Удалить(ВыборкаПоОтбору.КлючОбъекта, ВыборкаПоОтбору.КлючНастроек, ВыборкаПоОтбору.Пользователь);
		КонецЕсли;
	КонецЦикла;
	// } RGS Козлов К.С. 02.02.2016 13:56:30	
	
	МассивНастроекДляКопирования = ПолучитьМассивНастроек();
	
	ФормаАдресат = МассивНастроекДляКопирования[0];
	
	Обработка = РеквизитФормыВЗначение("Объект");
	// { RGS Козлов К.С. 02.02.2016 13:46:48
	//СтруктураДанных = Обработка.ПолучитьСтруктуруДанныхФорм(ПроектБазы, ПолучитьМассивСтруктурИзТЗ(),ПолучитьМассивСтруктурИзТЗОбъекта());
	// } RGS Козлов К.С. 02.02.2016 13:46:48
	Для Каждого Строка Из Объект.СписокСуществующихНастроек Цикл
		НастройкиФормы = ХранилищеСистемныхНастроек.Загрузить(ФормаАдресат + "/НастройкиФормы", Строка.Представление,, "");		
		ХранилищеСистемныхНастроек.Сохранить(ФормаАдресат + "/НастройкиФормы",Строка.Представление ,НастройкиФормы,, Строка.Пользователь);
		ХранилищеСистемныхНастроек.Сохранить(ФормаАдресат + "/НастройкиОкна",Строка.Представление ,НастройкиФормы,, Строка.Пользователь);
		ХранилищеНастроекДанныхФорм.Сохранить(ФормаАдресат, Строка.Представление,НастройкиФормы,,Строка.Пользователь);
		ХранилищеНастроекДанныхФорм.Сохранить(ФормаАдресат + "/НастройкиФормы", Строка.Представление,НастройкиФормы,,Строка.Пользователь);
		Строка.Настройки = ЗначениеВСтрокуВнутр(НастройкиФормы);
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Обработка.СохраненныеНастройки,Объект.СохраненныеНастройки);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
